historic/moonshot-C15N1/C24N1/results/mixed-301-1to4k_10Mseq.fio.out
randread-1k-4k: (g=0): rw=randread, bs=1K-4K/1K-4K/1K-4K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 3 processes

randread-1k-4k: (groupid=0, jobs=1): err= 0: pid=25372: Fri May 27 17:36:44 2016
  read : io=9122.5MB, bw=155680KB/s, iops=73902, runt= 60001msec
    slat (usec): min=1, max=761, avg= 4.51, stdev= 7.23
    clat (usec): min=8, max=272235, avg=129.32, stdev=505.53
     lat (usec): min=21, max=272240, avg=133.94, stdev=505.64
    clat percentiles (usec):
     |  1.00th=[   76],  5.00th=[   84], 10.00th=[   88], 20.00th=[   93],
     | 30.00th=[   99], 40.00th=[  103], 50.00th=[  108], 60.00th=[  113],
     | 70.00th=[  120], 80.00th=[  133], 90.00th=[  159], 95.00th=[  195],
     | 99.00th=[  540], 99.50th=[  756], 99.90th=[ 1464], 99.95th=[ 1592],
     | 99.99th=[ 7520]
    bw (KB  /s): min= 5829, max=199964, per=93.86%, avg=155758.15, stdev=36007.48
    lat (usec) : 10=0.01%, 20=0.01%, 50=0.11%, 100=31.40%, 250=65.14%
    lat (usec) : 500=2.27%, 750=0.58%, 1000=0.16%
    lat (msec) : 2=0.33%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 500=0.01%
  cpu          : usr=16.97%, sys=44.35%, ctx=1395997, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=4434205/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=25373: Fri May 27 17:36:44 2016
  read : io=616448KB, bw=10274KB/s, iops=10, runt= 60002msec
    slat (usec): min=74, max=897, avg=210.50, stdev=99.98
    clat (usec): min=432, max=175721, avg=1328.64, stdev=7449.80
     lat (usec): min=649, max=175934, avg=1539.72, stdev=7456.63
    clat percentiles (usec):
     |  1.00th=[  556],  5.00th=[  572], 10.00th=[  588], 20.00th=[  612],
     | 30.00th=[  628], 40.00th=[  644], 50.00th=[  668], 60.00th=[  692],
     | 70.00th=[  724], 80.00th=[  772], 90.00th=[  892], 95.00th=[ 2512],
     | 99.00th=[10304], 99.50th=[13632], 99.90th=[175104], 99.95th=[175104],
     | 99.99th=[175104]
    bw (KB  /s): min= 7148, max=12275, per=6.18%, avg=10257.49, stdev=396.72
    lat (usec) : 500=0.17%, 750=75.75%, 1000=14.62%
    lat (msec) : 2=3.16%, 4=3.16%, 10=1.99%, 20=0.83%, 50=0.17%
    lat (msec) : 250=0.17%
  cpu          : usr=0.01%, sys=0.24%, ctx=1181, majf=0, minf=525
  IO depths    : 1=97.0%, 2=0.7%, 4=1.3%, 8=1.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=602/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=25374: Fri May 27 17:36:44 2016
  write: io=616448KB, bw=10274KB/s, iops=10, runt= 60002msec
    slat (usec): min=84, max=1145, avg=207.05, stdev=95.41
    clat (usec): min=539, max=272853, avg=2524.42, stdev=12585.37
     lat (usec): min=757, max=273056, avg=2732.04, stdev=12589.45
    clat percentiles (usec):
     |  1.00th=[  652],  5.00th=[  684], 10.00th=[  700], 20.00th=[  828],
     | 30.00th=[  844], 40.00th=[  852], 50.00th=[  868], 60.00th=[  884],
     | 70.00th=[  900], 80.00th=[  916], 90.00th=[ 1128], 95.00th=[ 6496],
     | 99.00th=[35584], 99.50th=[40704], 99.90th=[272384], 99.95th=[272384],
     | 99.99th=[272384]
    bw (KB  /s): min= 5485, max=12936, per=99.72%, avg=10244.00, stdev=580.83
    lat (usec) : 750=13.62%, 1000=75.58%
    lat (msec) : 2=2.66%, 4=1.83%, 10=2.33%, 20=1.66%, 50=1.83%
    lat (msec) : 100=0.33%, 500=0.17%
  cpu          : usr=0.06%, sys=0.19%, ctx=1185, majf=0, minf=10
  IO depths    : 1=96.8%, 2=0.7%, 4=1.3%, 8=1.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=602/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=9724.5MB, aggrb=165951KB/s, minb=10273KB/s, maxb=155680KB/s, mint=60001msec, maxt=60002msec
  WRITE: io=616448KB, aggrb=10273KB/s, minb=10273KB/s, maxb=10273KB/s, mint=60002msec, maxt=60002msec

Disk stats (read/write):
  nvme0n1: ios=4435403/5442, merge=0/0, ticks=520072/11508, in_queue=531128, util=99.70%