historic/moonshot-C15N1/C24N1/results/mixed-702-512Kto1M_20Mseq.fio.out
randread-512k-1m: (g=0): rw=randread, bs=512K-1M/512K-1M/512K-1M, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 3 processes

randread-512k-1m: (groupid=0, jobs=1): err= 0: pid=2592: Fri May 27 18:20:02 2016
  read : io=113392MB, bw=1889.8MB/s, iops=2803, runt= 60003msec
    slat (usec): min=32, max=4373, avg=137.46, stdev=80.83
    clat (usec): min=929, max=76962, avg=3425.29, stdev=1029.58
     lat (msec): min=1, max=77, avg= 3.56, stdev= 1.03
    clat percentiles (usec):
     |  1.00th=[ 2416],  5.00th=[ 2640], 10.00th=[ 2768], 20.00th=[ 2960],
     | 30.00th=[ 3088], 40.00th=[ 3216], 50.00th=[ 3344], 60.00th=[ 3472],
     | 70.00th=[ 3632], 80.00th=[ 3792], 90.00th=[ 4128], 95.00th=[ 4448],
     | 99.00th=[ 5152], 99.50th=[ 5536], 99.90th=[10560], 99.95th=[15680],
     | 99.99th=[73216]
    bw (MB  /s): min= 1426, max= 1959, per=98.89%, avg=1888.54, stdev=109.36
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.09%, 4=87.03%, 10=12.77%, 20=0.09%, 50=0.01%
    lat (msec) : 100=0.01%
  cpu          : usr=0.91%, sys=38.23%, ctx=155957, majf=0, minf=525
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=168215/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=2593: Fri May 27 18:20:02 2016
  read : io=1202.0MB, bw=20512KB/s, iops=20, runt= 60005msec
    slat (usec): min=88, max=1136, avg=237.23, stdev=115.53
    clat (usec): min=564, max=55003, avg=3707.57, stdev=2183.61
     lat (usec): min=722, max=55272, avg=3945.50, stdev=2188.54
    clat percentiles (usec):
     |  1.00th=[ 2576],  5.00th=[ 2864], 10.00th=[ 2992], 20.00th=[ 3184],
     | 30.00th=[ 3312], 40.00th=[ 3440], 50.00th=[ 3536], 60.00th=[ 3664],
     | 70.00th=[ 3792], 80.00th=[ 3952], 90.00th=[ 4256], 95.00th=[ 4576],
     | 99.00th=[ 6624], 99.50th=[ 8160], 99.90th=[54016], 99.95th=[55040],
     | 99.99th=[55040]
    bw (KB  /s): min=18432, max=24188, per=1.05%, avg=20527.76, stdev=436.68
    lat (usec) : 750=0.08%
    lat (msec) : 2=0.33%, 4=82.03%, 10=17.39%, 100=0.17%
  cpu          : usr=0.03%, sys=0.53%, ctx=2387, majf=0, minf=525
  IO depths    : 1=97.8%, 2=0.5%, 4=1.0%, 8=0.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1202/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=2594: Fri May 27 18:20:02 2016
  write: io=1202.0MB, bw=20512KB/s, iops=20, runt= 60006msec
    slat (usec): min=78, max=2333, avg=253.75, stdev=120.67
    clat (usec): min=690, max=46965, avg=4665.97, stdev=2496.70
     lat (usec): min=874, max=47245, avg=4920.41, stdev=2506.03
    clat percentiles (usec):
     |  1.00th=[ 3248],  5.00th=[ 3536], 10.00th=[ 3760], 20.00th=[ 3952],
     | 30.00th=[ 4128], 40.00th=[ 4256], 50.00th=[ 4384], 60.00th=[ 4512],
     | 70.00th=[ 4640], 80.00th=[ 4832], 90.00th=[ 5152], 95.00th=[ 5472],
     | 99.00th=[19328], 99.50th=[21376], 99.90th=[45824], 99.95th=[46848],
     | 99.99th=[46848]
    bw (KB  /s): min=18395, max=24046, per=100.00%, avg=20527.17, stdev=486.59
    lat (usec) : 750=0.17%
    lat (msec) : 2=0.17%, 4=22.30%, 10=75.87%, 20=0.50%, 50=1.00%
  cpu          : usr=0.16%, sys=0.45%, ctx=2410, majf=0, minf=9
  IO depths    : 1=99.3%, 2=0.2%, 4=0.3%, 8=0.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1202/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=114594MB, aggrb=1909.8MB/s, minb=20512KB/s, maxb=1889.8MB/s, mint=60003msec, maxt=60005msec
  WRITE: io=1202.0MB, aggrb=20512KB/s, minb=20512KB/s, maxb=20512KB/s, mint=60006msec, maxt=60006msec

Disk stats (read/write):
  nvme0n1: ios=1085188/10833, merge=0/0, ticks=3642904/41152, in_queue=3684428, util=99.89%